In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame({'col_1':['A','B','A','B','A','B','A','A'],
                  'col_2':['E','E','F','G','F','F','E','G'],
                  'col_3':np.random.rand(8),
                  'col_4':np.random.rand(8)})

In [4]:
df

  col_1 col_2     col_3     col_4
0     A     E  0.971995  0.623922
1     B     E  0.242524  0.216813
2     A     F  0.332688  0.688974
3     B     G  0.326759  0.328066
4     A     F  0.428319  0.320142
5     B     F  0.429862  0.376502
6     A     E  0.302695  0.649313
7     A     G  0.096561  0.988933

In [5]:
grouped = df.groupby('col_1')

In [6]:
for name, group in grouped:
    print(name)
    print(group)

A
  col_1 col_2     col_3     col_4
0     A     E  0.971995  0.623922
2     A     F  0.332688  0.688974
4     A     F  0.428319  0.320142
6     A     E  0.302695  0.649313
7     A     G  0.096561  0.988933
B
  col_1 col_2     col_3     col_4
1     B     E  0.242524  0.216813
3     B     G  0.326759  0.328066
5     B     F  0.429862  0.376502

In [7]:
grouped.describe()

      col_3                                                              \
      count      mean       std       min       25%       50%       75%
col_1
A       5.0  0.426452  0.328084  0.096561  0.302695  0.332688  0.428319
B       3.0  0.333048  0.093827  0.242524  0.284641  0.326759  0.378311

                col_4                                                    \
            max count      mean       std       min       25%       50%
col_1
A      0.971995   5.0  0.654257  0.237587  0.320142  0.623922  0.649313
B      0.429862   3.0  0.307127  0.081878  0.216813  0.272440  0.328066


            75%       max
col_1
A      0.688974  0.988933
B      0.352284  0.376502

In [8]:
grouped.sum()

          col_3     col_4
col_1
A      2.132259  3.271283
B      0.999145  0.921381

In [9]:
grouped.mean()

          col_3     col_4
col_1
A      0.426452  0.654257
B      0.333048  0.307127

In [11]:
grouped['col_4'].mean().round(2)

col_1
A    0.65
B    0.31
Name: col_4, dtype: float64

In [11]:
grouped.get_group('B')

  col_2     col_3     col_4
1     E  0.440970  0.468421
3     G  0.521831  0.009651
5     F  0.740706  0.205650

In [12]:
len(grouped)

2

In [14]:
grouped = df.groupby(['col_1','col_2'])

In [16]:
x = grouped.mean()
x

                col_3     col_4
col_1 col_2
A     E      0.732871  0.624800
      F      0.661545  0.547818
      G      0.194893  0.265279
B     E      0.440970  0.468421
      F      0.740706  0.205650
      G      0.521831  0.009651

In [17]:
x.index.get_level_values(0)

Index(['A', 'A', 'A', 'B', 'B', 'B'], dtype='object', name='col_1')

In [18]:
x.index.get_level_values(1)

Index(['E', 'F', 'G', 'E', 'F', 'G'], dtype='object', name='col_2')

In [19]:
grouped = df.groupby(['col_1','col_2'], as_index=False)

In [20]:
grouped['col_3'].mean()

  col_1 col_2     col_3
0     A     E  0.732871
1     A     F  0.661545
2     A     G  0.194893
3     B     E  0.440970
4     B     F  0.740706
5     B     G  0.521831

In [25]:
x = grouped['col_3'].agg([np.mean,np.median,np.std])

In [26]:
x

                 mean    median       std
col_1 col_2
A     E      0.732871  0.732871  0.006885
      F      0.661545  0.661545  0.195646
      G      0.194893  0.194893       NaN
B     E      0.440970  0.440970       NaN
      F      0.740706  0.740706       NaN
      G      0.521831  0.521831       NaN

In [28]:
x.reset_index()

  col_1 col_2      mean    median       std
0     A     E  0.732871  0.732871  0.006885
1     A     F  0.661545  0.661545  0.195646
2     A     G  0.194893  0.194893       NaN
3     B     E  0.440970  0.440970       NaN
4     B     F  0.740706  0.740706       NaN
5     B     G  0.521831  0.521831       NaN

In [29]:
grouped = df.groupby('col_1', as_index=False)

In [30]:
df

  col_1 col_2     col_3     col_4
0     A     E  0.737739  0.259573
1     B     E  0.440970  0.468421
2     A     F  0.523202  0.378044
3     B     G  0.521831  0.009651
4     A     F  0.799888  0.717591
5     B     F  0.740706  0.205650
6     A     E  0.728003  0.990028
7     A     G  0.194893  0.265279

In [31]:
grouped['col_3'].mean()

  col_1     col_3
0     A  0.596745
1     B  0.567836

In [34]:
grouped['col_3'].transform(lambda x : x - x.mean())

      col_3
0  0.140994
1 -0.126866
2 -0.073543
3 -0.046005
4  0.203143
5  0.172870
6  0.131258
7 -0.401852